{
  "backend/main.mo": "Motoko actor defining CRUD operations for Party, Location, DocumentPreparer, and DeedDraft records, each stored in persistent maps with sorted query methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (party management, location management, document preparer, sale deed form, agreement deed form, drafts) to their corresponding source files and test IDs.",
  "frontend-file-summaries.txt": "JSON object providing one-sentence summaries of each frontend source file, serving as a quick reference for the purpose of each page and component.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Tamil Property Deed Management System' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Main application entry point that configures TanStack Router with six routes (home, parties, locations, sale-deed, agreement-deed, drafts) wrapped in the Layout component.",
  "frontend/src/components/DocumentPreparerSelect.tsx": "Reusable component for selecting an existing document preparer from a dropdown or adding a new one via a dialog, wired to IC backend queries and mutations.",
  "frontend/src/components/Layout.tsx": "Application shell providing a collapsible sidebar with Tamil/English navigation labels, a top header, mobile overlay support, and a Sonner toast provider.",
  "frontend/src/components/PartyFormFields.tsx": "A form component for entering party information (name, age, relationship, Aadhaar, PAN, mobile, address) used in Tamil legal document generation. Renders labeled inputs and a relationship type dropdown with Tamil/English bilingual labels.",
  "frontend/src/components/PartySearchSelect.tsx": "A searchable dropdown component for selecting parties by name, Aadhaar, or mobile number, displaying selected parties as removable tags. Supports adding and removing multiple parties from a provided list.",
  "frontend/src/components/TamilPreview.tsx": "A live preview component for Tamil legal documents that renders formatted content and provides print and HTML download functionality. Uses a popup window for printing with Mukta Malar font and A4 page styling.",
  "frontend/src/components/WitnessFormFields.tsx": "A form component for entering witness information (name, age, relationship, Aadhaar, address) for Tamil legal documents. Similar to PartyFormFields but scoped to witness data with a smaller relationship type list.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, falling back to an anonymous actor when unauthenticated. Invalidates and refetches dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence across page reloads using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on parties, locations, document preparers, and deed drafts, each delegating to a backend actor obtained via useActor.",
  "frontend/src/index.css": "Global stylesheet that imports Tamil/serif fonts, sets up Tailwind layers, defines OKLCH-based CSS custom properties for light/dark themes, and adds Tamil document preview and print styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AgreementDeedForm.tsx": "Multi-step form page for creating a Tamil property agreement deed, collecting seller/buyer/property/transaction/witness details and rendering a live Tamil-language preview with save-draft support.",
  "frontend/src/pages/Drafts.tsx": "Page that lists saved deed drafts in a table with options to preview, resume editing, or delete each draft, using useGetAllDrafts and useDeleteDraft hooks.",
  "frontend/src/pages/Home.tsx": "Dashboard home page displaying summary stats for parties, locations, and drafts alongside quick-navigation links to key app sections.",
  "frontend/src/pages/LocationManagement.tsx": "A CRUD management page for office locations (Tamil UI) that supports adding, editing, deleting, and searching locations using React Query hooks and dialog/alert-dialog components.",
  "frontend/src/pages/PartyManagement.tsx": "A CRUD management page for parties/persons (Tamil UI) that supports adding, editing, deleting, and searching party records by name, Aadhaar, or mobile using React Query hooks.",
  "frontend/src/pages/SaleDeedForm.tsx": "A multi-step form for creating Tamil sale deed documents, collecting seller, buyer, property, transaction, and witness details, with draft-saving and live Tamil text preview.",
  "frontend/src/utils/tamilNumberConverter.ts": "Utility functions that convert numeric amounts into Tamil word representations (e.g., crores, lakhs, thousands) and format numbers in Indian locale.",
  "frontend/src/utils/tamilTextGenerator.ts": "Defines TypeScript interfaces for deed data (parties, witnesses, transactions, etc.) and provides helper functions to generate formatted Tamil-language text blocks for sale deed and agreement deed documents.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Tamil/English), OKLCH-based color tokens, border radii, box shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 3) for a Tamil-language property deed management system built on Internet Computer (Motoko) backend with React/TypeScript frontend, documenting existing features, architectural notes, and known issues."
}